import 'package:edmanly/core/extensions/string_ext.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

import '../../../constants/app_colors.dart';
import '../../shared_widgets/text_widget.dart';

class TermsAndConditions extends StatefulWidget {
 bool checkedValue;
 final void Function(bool?) onchange;
   TermsAndConditions({super.key,  required this.checkedValue,required this.onchange});
  @override
  State<TermsAndConditions> createState() => _TermsAndConditionsState();
}

class _TermsAndConditionsState extends State<TermsAndConditions> {
 // bool checkedValue = false;
  @override
  Widget build(BuildContext context) {
    return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Container(
          height: 300.h,
          padding: const EdgeInsets.all(10),
          margin: EdgeInsetsDirectional.only(bottom: 10.h),
          decoration: BoxDecoration(
              border: Border.all(color:errorColor,width: 1),
              borderRadius: BorderRadius.circular(5)
          ),
          child: const SingleChildScrollView(
            child: Text(
              overflow: TextOverflow.clip,
              softWrap: true,
              "الشروط والاحكام\n"
              "ضوابط وشروط وأحكام المستخدم لمنصة إضمنلي\n"
              "1- منصة إضمنلي تقدم خدمة التوثيق وتمكين المستخدم من إبرام العقد مع الطرف الآخر وتوثيقه لبيع أو شراء سلع أو منتجات أو غيرها وفق ضوابط وشروط وأحكام منصة إضمنلي ولا يقع على عاتق منصة إضمنلي أي ضمانات أو التزامات بين المستخدم والأطراف الأخرى.\n"
              "2- لا تتحمل منصة إضمنلي أي مسؤولية في حالة عدم التزام المستخدم بسياسة وضوابط وشروط وأحكام استخدام المنصة ولا تتحمل منصة إضمنلي المسؤولية عن أي مخاطر أو أضرار أو تبعات أو خسائر تقع على البائع أو المشتري أو أي طرف آخر\n."
              "3- تمثل هذه الضوابط والشروط والأحكام اتفاق رسمي بين منصة إضمنلي والعملاء المستخدمين لمنصة إضمنلي والتي هي عبارة عن منصة إلكترونية تسمح للعملاء توثيق الإتفاقات والعقود بين الأطراف، وأن إضمنلي هي عبارة عن وسيط بين الأطراف.\n"
              "4- يقر المستخدم بعدم تحميل محتوى مخالف أو سلع ممنوعة نظاماً ويتعهد المستخدم بعدم الاختراق أو التحايل على قوانين وأنظمة جمهورية مصر العربية وسياسة وأنظمة منصة إضمنلي أو أي حقوق تتعلق بأطراف أخرى.\n"
              "5- تقر بأنك تتحمل كامل المسؤولية عن محتوى الإعلان الذي تقوم بنشره.\n"
              "6- تخول منصة إضمنلي في حفظ بياناتك التي قمت بإدخالها بخوادم المنصة ولإضمنلي حق الاطلاع عليها ومراجعتها والاحتفاظ بها. كما أنك توافق على أحقيتنا في مراقبة الرسائل الخاصة عند الحاجة لضمان خلوها من مخالفات اتفاقية الاستخدام ولنا حق التحكم الكامل في حسابك علي المنصة .\n"
              "7- تعتبر تعاميم وقرارات وتوجيهات إدارة ومشرفي المنصة ملزمة للمستخدم بعد إيصالها له عبر الرسائل الخاصة بالمنصة أو الهاتف المحمول أو البريد الإلكتروني أو عبر نظام الإشعارات، وعليه الالتزام بها والعمل بموجبها.\n"
              "8- توافق أنه في حال مخالفتك لأنظمة منصة إضمنلي والتسبب بأضرار للمنصة فإنه يحق لإدارة المنصة مطالبتك بالتعويضات عن جميع الأضرار التي لحقت بها بسبب مخالفتك للأنظمة بما في ذلك أتعاب المحاماة وأتعاب التقاضي والخبرة وغيرها في جميع القضايا المتعلقة بمخالفاتك.\n"
              "9- إن أي استخدام من قبلك للخدمات التي توفرها منصة إضمنلي يشكل موافقة كاملة منك على هذه الشروط وأحكامه، وتبعاً لذلك يجب عليك عدم استخدام المنصة في حال لم تكن موافقاً على هذه الأحكام والشروط.\n"
              "10- لمنصة إضمنلي الحق بتعديل أو تغيير هذه الأحكام والشروط دون إخطار مسبق، ويكون من مسؤوليتك كمستخدم للمنصة مراجعة ضوابط وشروط الاستخدام بشكل دوري لمعرفة التحديثات التي تطرأ على الأحكام والشروط هذه.\n"
              "11- تقر وتضمن أنك تتمتع بكامل القوى العقلية والشرعية والنظامية للتعاقد وأنك بذلك لن تكون منتهكاً لأنظمة جمهورية مصر العربية ولا مخالفاً لاتفاقية وشروط وأحكام المنصة، وأن لا يوجد عليك أي سوابق قضائية أو أوامر قبض لدى الجهات القضائية والأمنية.\n"
              "12- تقر بعدم استخدام خدمات إضمنلي إذا كنت غير مؤهل قانونيا لإتمام هذه الاتفاقية، على سبيل المثال لا الحصر أنك أقل من 18 سنة أو أنك محجوب بشكل مؤقت أو دائم من استخدام المنصة.\n"
              "13- تقر بأنك طرف مستقل ولا تعمل كوكيل أو ممثل أو موزع أو غير ذلك، وأنك المسؤول الأول عن أي تعاقدات تتم بينك وبين المستخدمين الآخرين.\n"
              "14- تتعهد بعدم التلاعب بأسعار السلع سواء في البيع او الشراء وإلحاق الضرر بالمستخدمين الآخرين، وعدم نشر إعلانات أو تعليقات كاذبة أو غير دقيقة أو مضللة أو خادعة أو قذف ، أو تشهير أو غيرها من المخالفات والتجاوزات.\n"
              "15- تقر بعدم التعرض للسياسات الداخلية والخارجية أو السيادات الدولية أو الشخصيات المعتبرة أو أي مناقشات لا تتعلق بالعقود والإتفاقات المشروعة في منصة إضمنلي.\n"
              "16- تلتزم بعدم انتهاك حقوق الطبع والنشر والعلامات التجارية، وبراءات الاختراع والملكية الفكرية الخاصة بمنصة إضمنلي.\n"
              "17- تتعهد بعدم توثيق بيع أو شراء أي نشاط غير قانوني - بما في ذلك الترويج لأي نشاط إجرامي؛ أو تسهيل الجرائم الإلكترونية أو المشاركة فيها؛ أو شراء أو بيع أو تسهيل بيع العقاقير غير المشروعة أو الخاضعة للرقابة، وكذلك الممنوعات والأسلحة والسلع أو المستندات والمنتجات المقلدة، وجميع الممنوعات النظامية والشرعية في جمهورية مصر العربية، كما تخلي منصة إضمنلي مسؤوليتها الكاملة عن التعاقد والإتفاق علي منتجات مخالفة بين المستخدم والأطراف الآخرين، وفي حال صدور المخالفة من المستخدم فيحق لإضمنلي مطالبته وتقديم معلوماته للجهات المختصة.\n"
              "18- يحق لمنصة إضمنلي إلغاء أي عملية تم توثيقها من قبل المستخدم دون إعادة المبلغ، وذلك في حال مخالفة الضوابط وشروط وأحكام منصة إضمنلي.\n"
              "19- تتعهد بأن تمتثل لكافة القوانين واللوائح المعمول بها في جمهورية مصر العربية وخارجها.\n"
              "20- تقر بأن تستخدم الخدمة أو منصة إضمنلي لأغراض مشروعة فقط، ولن تستخدم الخدمات لشراء أو بيع أو استلام أي مواد غير قانونية أو بهدف الاحتيال أو غيره من المحظورات النظامية.\n"
              "21- توافق على تبادل المعلومات الشخصية وغيرها بين الأطراف داخل المنصة فيما يخص عملياتك المنفذة وتقييم التعاملات معك، ويحق لإضمنلي الاحتفاظ بها والرجوع لها متى ما دعت الحاجة.\n"
              "22- يحق لمنصة إضمنلي حظر المستخدم دون اخطار كما يحق له رفض تقديم الخدمة أو استخدام المنصة دون إبداء أسباب.\n"
              "23– تقر بأن لا تحترم خصوصية الأطراف الأخري في المنصة.\n"
              "24- يحظر عدم بيع أو شراء المنتجات والسلع الممنوعة حسب أنظمة جمهورية مصر العربية، ويتحمل المستخدم جميع تبعاتها القانونية، وتخلي منصة إضمنلي مسؤوليتها الكاملة.\n"
              "25- تقع مسؤولية جودة الخدمات المطلوبة باستخدام المنصة أو الخدمة بأكملها على عاتق طالب الخدمة ولا تقبل إضمنلي تحت أي ظرف من الظروف أي مسؤولية تتعلق بالخدمات التي يقدمها طالب الخدمة أو تنشأ عنه، كما لا تقبل المسؤولية عن أي أفعال أو تصرفات أو سلوك أو إهمال، أو جميع ما سبق، من جانب طالب الخدمة ومن ثم فإن أي شكاوى بشأن الخدمات يجب تقديمها على طالب الخدمة.\n"
              "26- يقر المستخدم في حال تعرض لعملية نصب واحتيال من قبل طرف آخر فعليه إبلاغ الجهات المختصة، ومنصة إضمنلي ليست طرف في أي خلاف ينشأ بين المستخدمين لمخالفة أحدهما أو كلاهما شروط وأحكام منصة إضمنلي.\n"
              "27- تتعهد المنصة بالخصوصية وسرية المعلومات الشخصية والبنكية للمستخدم.\n"
              "28- تخضع شروط المستخدم الماثلة ويطبق على تسوية أي نزاع أو مطالبة أو خلاف ينشأ عن شروط المستخدم الماثلة أو يتعلق بها أو أي انتهاك لها أو إنهائها أو تنفيذها أو تفسيرها أو صحتها أو استخدام الموقع أو الخدمة أو المنصة، للقوانين والأنظمة المطبقة في جمهورية مصر",
             style: TextStyle(
               fontSize: 12
             ),
            ),
          ),
        ),
        CheckboxListTile(
          activeColor: errorColor,
          title: TextWidget('check_box_title'.tr, align: TextAlign.start,),
          value: widget.checkedValue,
          checkColor: white,
          onChanged: widget.onchange,
          controlAffinity: ListTileControlAffinity
              .leading, //  <-- leading Checkbox
        ),
      ],
    );
  }
}
